---
kind: method
id: M:Autodesk.Revit.DB.RoutingConditions.GetNumberOfConditions
source: html/951a264e-7fc6-7494-5a45-87f161a64dcc.htm
---
# Autodesk.Revit.DB.RoutingConditions.GetNumberOfConditions Method

Gets the number of included routing conditions.

## Syntax (C#)
```csharp
public int GetNumberOfConditions()
```